# 5.Analyse de données

In [10]:
import pandas as pd
import numpy as np

In [11]:
#afficher fichier tendance_centrale csv
dataTC = pd.read_csv("./Data/tendance_centrale.csv",sep=',')
dataTC.head()

         Nom  Age  Rating
0    ANATOLE   55    4.53
1   Vincent    59    3.54
2    Brenda    55    3.98
3  Philippe    53    5.59
4    Michel    30    3.50

In [28]:
#Moyenne
dataTC.mean()

Age       45.647059
Rating     4.438824
dtype: float64

In [29]:
#Moyenne d'Age
dataTC['Age'].mean()

45.64705882352941

In [13]:
#Medianne
dataTC.median()

Age       49.0
Rating     4.3
dtype: float64

In [14]:
#écart-type
dataTC.std()

Age       10.723462
Rating     0.800390
dtype: float64

In [15]:
#Mode
dataTC.mode()

     Nom   Age  Rating
0  perez  53.0    3.78
1    NaN   NaN    3.95
2    NaN   NaN    4.30
3    NaN   NaN    4.80
4    NaN   NaN    5.98

In [30]:
#Variance
dataTC.var()

Age       114.992647
Rating      0.640624
dtype: float64